#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10813                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10813                          #+#        #+#      #+#     #
#    Solved: 2023/12/09 23:45:13 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
# 바구니 N (1~N) list[0~N-1]
# 바구니 내부에는 같은 번호
# M = 바구니 공 교환 횟수
n, m = map(int, input().split(" "))
b = [str(i) for i in range(1, n+1)] # 실제 교환되는 공의 자리는 c-1

for _ in range(m):
  c1, c2 = map(int, input().split(" "))
  b[c1-1], b[c2-1] = b[c2-1], b[c1-1]

print(" ".join(b))