#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 14681                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/14681                          #+#        #+#      #+#     #
#    Solved: 2023/08/11 07:36:21 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
x = int(input())
y = int(input())
if x > 0 and y > 0 :	# x,y: 양수
    print(1)
elif x < 0 and y > 0 :	# x:음수, y:양수
    print(2)
elif x < 0 and y < 0 :	# x,y: 음수
    print(3)
else:
    print(4)