#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 4796                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/4796                           #+#        #+#      #+#     #
#    Solved: 2023/12/18 01:49:42 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
# L일간, 연속하는 P일, V일짜리 휴가
# 연속하는 P일은 V일짜리 휴가 안에 완전 독립된 형태로 포함되어 있다.
# [][][][][][][][][][][][][][][][][][][][][][]...
# {V}{V}{V}{X}/{}{}{}{}/{}{}{}{}/{}{}{}{}
case = 0
while True:
  result = 0
  case += 1
  l, p, v = map(int, input().split(" "))
  if l == 0 and p == 0 and v == 0:
    break

  result += (v//p)*l + min(v%p, l)

  print(f"Case {case}: {result}")