#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1100                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1100                           #+#        #+#      #+#     #
#    Solved: 2023/12/14 15:39:32 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
cnt = 0

# 입력받기
# .F.F...F (짝수번째 인덱스)

for i in range(1, 9):
  if i % 2 == 1:
    s = list(input())
    for j in range(0, 8, 2):
      if s[j] == "F":
        cnt += 1
  if i % 2 == 0:
    s = list(input())
    for j in range(1, 9, 2):
      if s[j] == "F":
        cnt += 1

print(cnt)