#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1259                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1259                           #+#        #+#      #+#     #
#    Solved: 2023/11/14 00:51:58 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
while True:
  n = input()
  reversed_n = n[::-1]
  if n == "0":
    break # False를 사용할 경우, 코드는 아무런 작업을 하지 않고 종료됨
  if n == reversed_n:
    print("yes")
  else:
    print("no")