#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2751                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2751                           #+#        #+#      #+#     #
#    Solved: 2023/11/22 21:40:08 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
# 기본적인 정렬문제
# 첫째 줄에 주어진 수만큼 입력을 받아 리스트에 넣어서 저장한다
# 리스트에 넣은 입력 요소들을 sorted()알고리즘으로 정렬한다
# 리스트를 내부 순회하여 print()한다.
import sys
input = sys.stdin.readline

n = int(input())
l = []

for _ in range(n):
  l.append(int(input()))

l.sort()

for i in l:
  print(i)