#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2609                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2609                           #+#        #+#      #+#     #
#    Solved: 2023/08/28 14:33:34 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  ##
# 최대공약수의 특징 : 공통의 약수 중 최대
# 최소공배수의 특징 : 공동의 배수 중 최대

x, y = map(int, input().split())

n = [a for a in range(1, max(x, y)+1)]
gcd = 0
lcm = 0

for i in n:
    if x%i!=0 or y%i!=0:
      n[i-1] = 0 # 공통의 약수
      gcd = max(n)
lcm = x*y // gcd

print(gcd)
print(lcm)

