#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10156                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10156                          #+#        #+#      #+#     #
#    Solved: 2023/08/15 12:51:18 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
import sys
input = sys.stdin.readline

k, n, m = map(int, input().split())

if m >= k*n:
    print(0)
else:
    print(k*n-m) # 숫자끼리의 연산은 굳이 타입변환을 하지 않아도 => 알아서 타입 추론!