#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10808                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10808                          #+#        #+#      #+#     #
#    Solved: 2023/08/11 11:47:27 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
# ? 일일이 전부 맵핑하여 자료구조 리스트를 만들어야 하는걸까?


alphabet_arr = {'a':0, 'b':0, 'c':0, 'd':0,'e':0,'f':0,'g':0, 'h':0,'i':0,'j':0,'k':0,'l':0,'m':0,'n':0,'o':0,'p':0,'q':0,'r':0,'s':0,'t':0,'u':0,'v':0,'w':0,'x':0,'y':0,'z':0,}
input_str = input()

for i in input_str:
  alphabet_arr[i] += 1

print(*alphabet_arr.values())