#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2292                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: shaawwert6044 <boj.kr/u/shaawwert6044>      +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2292                           #+#        #+#      #+#     #
#    Solved: 2023/08/20 15:08:24 by shaawwert6044 ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

# 기본 아이디어 :
# - 1개의 방 : 1 , n = 1
# - 2개의 방 : 2~7 , n = 2
# - 3개의 방 : 8~19, n = 3
# - 4개의 방 : 20~37, n = 4
# - 5개의 방 : 38~61, n = 5

import sys
input = sys.stdin.readline

n = int(input())
r = 1 # 벌집의 개수
f = 1 # 지나야 하는 방의 수 : 계층

while n > r:
    r += 6*f
    f += 1

print(f)